name: "particle_classifier_v1"
backend: "onnxruntime"
max_batch_size: 1

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 28 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
